onlibrary/app/controllers/admin_dashboard_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def index
     user_id = session[:current_user]
     user = User.find_by_id(user_id)
     if !user.present? || User.find_by_id(user_id).role != UsersController::Roles::ADMIN