onlibrary/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."role" = 'user' AND "users"."id" IS NULL LIMIT 1
---
  def current_user
    @current_user ||= User.where(role: UsersController::Roles::USER).find_by_id(session[:current_user])

SELECT "users".* FROM "users" WHERE "users"."role" = 'admin' AND "users"."id" IS NULL LIMIT 1
---
  def current_admin
    @current_admin ||= User.where(role: UsersController::Roles::ADMIN).find_by_id(session[:current_user])