onlibrary/app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    @books = Book.all

SELECT "books".* FROM "books" WHERE "books"."name" = 'Война и мир' LIMIT 1
UPDATE "books" SET "count" = 202, "updated_at" = '2024-12-24 23:34:06.972522' WHERE "books"."id" = 1
INSERT INTO "books" ("name", "author", "count", "created_at", "updated_at") VALUES ('Война и мир', 'Лев Толстой', 10, '2024-12-25 01:37:47.581625', '2024-12-25 01:37:47.581625') RETURNING "id"
---
  def create
    found_book = Book.find_by_name(book_params[:name])
    if found_book.author == book_params[:author]
      found_book.count += book_params[:count]
      if found_book.save
        redirect_to admin_dashboard_path
      else
        redirect_to admin_dashboard_new_book_path
      end
      return
    end
    new_book = Book.new(book_params)
    if new_book.save