onlibrary/app/controllers/operations_controller.rb

SELECT "operations".* FROM "operations" WHERE "operations"."book" = 1 LIMIT 1
---
  def show
    operations = Operation.where(book: params[:book_id], returned: nil)