onlibrary/app/controllers/operations_controller.rb

SELECT "operations"."user_id" FROM "operations" WHERE "operations"."book_id" = 1 AND "operations"."returned" IS NULL
SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 3)
SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1
---
  def show
    operations = Operation.where(book_id: params[:book_id], returned: nil)
    user_ids = operations.pluck(:user_id)
    @users = User.where(id: user_ids)
    @book = Book.find_by_id(params[:book_id])

SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def index
    @book = Book.find_by_id(params[:book_id])
    @user = User.find_by_id(params[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1
SELECT "operations".* FROM "operations" WHERE "operations"."book" = 1 LIMIT 1
SELECT 1 AS one FROM "operations" WHERE "operations"."user_id" = 2 AND "operations"."id" != 1 AND "operations"."book_id" = 1 AND "operations"."returned" IS NULL LIMIT 1
SELECT "operations".* FROM "operations" WHERE "operations"."user_id" = 2 AND "operations"."book_id" = 1
UPDATE "operations" SET "returned" = '2024-12-22 21:22:59.634921' WHERE "operations"."id" = 1
UPDATE "books" SET "count" = 99, "updated_at" = '2024-12-22 21:22:59.652041' WHERE "books"."id" = 1
UPDATE "books" SET "count" = 1, "updated_at" = '2024-12-22 20:56:16.595711' WHERE "books"."id" = 1
UPDATE "operations" SET "returned" = '2024-12-22 20:56:16.575389' WHERE "operations"."id" = 1
---
  def update
    user = User.find_by_id(params[:user_id])
    book = Book.find_by_id(params[:book_id])

    if user.nil? || book.nil? || Operation.where(user_id: user.id, book_id: book.id, returned: nil).empty?
      redirect_to admin_dashboard_take_book_path(params[:book_id])
      return
    end

    book.count += 1

    # полагаем, что пользователь не может взять две одинаковые книги
    operations = Operation.where(user_id: user.id, book_id: book.id)
    operations.each do |operation|
      operation.update(returned: Time.zone.now)
    end
    book.save
    user.save

SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."email" = '1234@mail.ru' LIMIT 1
INSERT INTO "operations" ("user", "book", "took", "returned", "book_id", "user_id") VALUES (NULL, NULL, '2024-12-26 20:16:04.416717', NULL, 4, 3) RETURNING "id"
UPDATE "books" SET "count" = 102, "updated_at" = '2024-12-22 21:30:24.715227' WHERE "books"."id" = 1
---
  def create
    book = Book.find_by_id(params[:book_id])

    user = User.find_by_email(operation_params[:email])

    if user.nil? || book.nil?
      redirect_to admin_dashboard_give_out_book_path(params[:book_id])
      return
    end

    operation = Operation.new
    operation.user_id = user.id
    operation.book_id = book.id
    operation.took = Time.zone.now

    if book.count > 0
      begin
        if operation.save
          book.count -= 1
          book.save