onlibrary/app/controllers/sessions_controller.rb

  def create
    user = User.find_by_email(auth_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = '123@mail.ru' LIMIT 1