onlibrary/app/controllers/user_dashboard_controller.rb

  def index
    user = User.find_by_id(session[:current_user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def show
    operations = Operation.where(user_id: session[:current_user], returned: nil)
    book_ids = operations.pluck(:book_id)
    @borrowed_books = Book.where(id: book_ids)
---
SELECT "operations"."book_id" FROM "operations" WHERE "operations"."user_id" = 2 AND "operations"."returned" IS NULL
SELECT "books".* FROM "books" WHERE "books"."id" IN (2, 1)

  def all_books
    @books = Book.where("count > ?", 0)
---
SELECT "books".* FROM "books" WHERE (count > 0)

  def history
    operations = Operation.where(user_id: session[:current_user]).where.not(returned: nil)
    book_ids = operations.pluck(:book_id)
    @returned_books = Book.where(id: book_ids)
---
SELECT "operations".* FROM "operations" WHERE "operations"."user_id" = 2 AND "operations"."returned" IS NOT NULL ORDER BY "operations"."returned" DESC
SELECT "operations"."book" FROM "operations" WHERE "operations"."user" = 1 AND "operations"."returned" IS NOT NULL ORDER BY "operations"."returned" DESC
SELECT "books".* FROM "books" WHERE "books"."id" IN (1, 1, 1, 1, 1, 1, 1, 1, 1)