onlibrary/app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ('123', '123@mail.ru', '$2a$12$jXJpAagyQXCnh/hbxHPLLuGb6wsuJMfiRJ4N4lz7/0dutmquTWuWG', '2024-12-18 09:08:25.661298', '2024-12-18 09:08:25.661298') RETURNING "id"