onlibrary/app/controllers/user_dashboard_controller.rb

SELECT "operations".* FROM "operations" WHERE "operations"."user" = 1 AND "operations"."returned" IS NOT NULL ORDER BY "operations"."returned" DESC
---
  def history
    operations = Operation.where(user: session[:current_user]).where.not(returned: nil)