onlibrary/app/views/books/index.html.erb

          <% end %>
          <% if Operation.where(book: book.id, returned: nil).count != 0%>
---
SELECT COUNT(*) FROM "operations" WHERE "operations"."book_id" = 1 AND "operations"."returned" IS NULL