onlibrary/app/views/books/index.html.erb

SELECT COUNT(*) FROM "operations" WHERE "operations"."book_id" = 1 AND "operations"."returned" IS NULL
---

                <% if Operation.where(book_id: book.id, returned: nil).count != 0%>