onlibrary/app/views/user_dashboard/history.html.erb

        <tr class="hover:bg-gray-100">
          <td class="py-2 px-4 border-b"><%= Book.find_by_id(operation.book).name %></td>
---
SELECT "books".* FROM "books" WHERE "books"."id" IN (1, 1, 1, 1, 1, 1, 1, 1, 1)