onlibrary/app/views/user_dashboard/history.html.erb

        <tr class="hover:bg-yellow-100 transition-all duration-300 ease-in-out">
          <td class="py-4 px-6 border-b border-gray-300"><%= Book.find_by_id(operation.book).name %></td>
          <td class="py-4 px-6 border-b border-gray-300"><%= Book.find_by_id(operation.book).author %></td>
---
SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1