onlibrary/app/views/user_dashboard/show.html.erb

          <td class="py-4 px-6 border-b border-gray-300">
            <%= Operation.order(returned: :desc).find_by_book_id(book.id).took.strftime("%d-%m-%Y") %>
---
SELECT "operations".* FROM "operations" WHERE "operations"."book_id" = 1 ORDER BY "operations"."returned" DESC LIMIT 1